Repository: leonodev/fintechKids-ios-app
Catalog: Localizable.xcstrings
Source language: en
Languages: es, fr, it

# access_camera_btn_open_setting_permission
source: go to settings
es: ir a ajustes
fr: aller aux réglages
it: vai alle Impostazioni

# access_camera_btn_open_skin_permission
source: maybe later
es: quizás mas tarde
fr: plus tard
it: forse più tardi

# access_camera_msn_permission
source: we need access to capture photos of your receipts. You may need to send transaction support documents.
es: necesitamos acceso para capturar fotos de tus recibos. es posible que tengas que enviar soportes de…
fr: nous avons besoin d'un accès pour capturer vos reçus. Il est possible que vous deviez envoyer des justificatifs de transaction.
it: abbiamo bisogno di accedere per scattare foto alle tue ricevute. Potrebbe essere necessario inviare documenti di supporto per le transazioni.

# access_camera_title_permission
source: access to camera
es: acceso a la camara
fr: accès à la caméra
it: Accesso alla fotocamera

# add_family_member_description
source: add a new member to your family and start assigning goals, rewards and seeing their achievements
es: añade un nuevo miembro a tu familia y comienza a asignar metas, recompensas y ver sus logros
fr: ajoutez un nouveau membre à votre famille et commencez à assigner des objectifs, des récompenses et à voir leurs réussites
it: aggiungi un nuovo membro alla tua famiglia e inizia ad assegnare obiettivi, premi e vedere i loro traguardi

# authentication_not_Implemented_error
source: authentication not implemented.
es: autenticación no implementada
fr: authentification non implémentée.
it: autenticazione non implementata.

source: cancel
es: cancelar
fr: annuler
it: annulla

# coins_required_create_reward_placeholder
source: amount of kidscoins required
es: cantidad kidscoins requeridos
fr: quantite de kidscoins requise
it: quantita di kidscoins richiesta

source: collect reward
es: cobrar recompensa
fr: encaisser la récompense
it: riscuotere il premio

source: confirm
es: confirmar
fr: confirmer
it: conferma

# confirm_password
source: confirm your password
es: confirma tu contraseña
fr: confirmez votre mot de passe
it: conferma la tua password

source: continue
es: continuar
fr: continuer
it: continuare

# create_reward
source: new reward
es: nueva recompensa
fr: nouvelle recompense
it: nuova ricompensa

# create_reward_title
source: create reward
es: crear recompensa
fr: creer recompense
it: creare ricompensa

# duration_missing
source: you must enter the maximum time to complete this goal.
es: debes ingresar el tiempo máximo para realizar esta meta.
fr: vous devez saisir le temps maximum pour réaliser cet objectif.
it: devi inserire il tempo massimo per completare questo obiettivo.

source: email
es: correo electrónico

# email_error
source: we couldn't get the email to associate your goal.
es: no hemos podido obtener el email para asociar tu meta.
fr: nous n'avons pas pu obtenir l'email pour associer votre objectif.
it: non siamo riusciti a ottenere l'email per associare il tuo obiettivo.

# email_not_confirmed_error
source: your account has not been confirmed yet, please check your email.
es: tu cuenta aún no ha sido confirmada, revisa tu correo electrónico.
fr: votre compte n'a pas encore été confirmé, veuillez vérifier vos e-mails.
it: il tuo account non è ancora stato confermato, controlla la tua email.

# error_name_member
source: not defined
es: no definido
fr: non défini
it: non definito

source: family name
es: nombre familia
fr: nom de famille
it: cognome

# goal
source: goal new
es: nueva meta
fr: nouvel objectif
it: nuovo obiettivo

# goal_list
source: goals list
es: lista de metas
fr: liste des objectifs
it: elenco obiettivi

# goal_rewards_value_placeholder
source: enter the goal value
es: ingrese el valor para la meta
fr: entrez la valeur de l'objectif
it: inserisci il valore per l'obiettivo

# goal_type_missing
source: you must select the goal type.
es: debes seleccionar el tipo de meta,
fr: vous devez sélectionner le type d'objectif.
it: devi selezionare il tipo di obiettivo.

# invalid_credentials_error
source: incorrect username and/or password, please check them and try again.
es: usuario y/o contraseña incorrecta, compruébalos e inténtalo de nuevo.
fr: nom d'utilisateur et/ou mot de passe incorrect, veuillez les vérifier et réessayer.
it: nome utente e/o password errati, controllali e riprova.

# key_loans_title
source: loans
es: prestamos
fr: prets
it: prestiti

# key_msn_auth_user_loading
source: authenticating user
es: autenticando usuario
fr: authentification de l'utilisateur
it: autenticazione utente

# key_payments_title
source: payments
es: pagos
fr: paiements
it: pagamenti

# key_saving_title
source: savings
es: ahorros
fr: epargne
it: risparmi

source: language
es: idioma
fr: langue
it: lingua

# loading
source: processing
es: procesando
fr: traitement
it: elaborazione

# msm_otp_expired_error
source: OTP expired, you must request a new one and try again
es: OTP expirada, debes solicitar una nueva e intentarlo de nuevo
fr: OTP expirée, vous devez en demander une nouvelle et réessayer
it: OTP scaduta, è necessario richiederne una nuova e riprovar

# msn_add_new_member_error
source: we couldn't add the new member(s), please close the app and try again
es: no hemos podido añadir el o los nuevos miembros, cierra la app e intentalo de nuevo
fr: nous n'avons pas pu ajouter le ou los nouveaux membres, veuillez fermer l'application et réessayer
it: non siamo riusciti ad aggiungere i nuovi membri, chiudi l'app e riprova

# msn_biometry_not_available_error
source: your device does not have biometrics, please log in with your username and password
es: tu dispositivo no cuenta con biometría, inicia sesión con tu usuario y contraseña
fr: votre appareil ne dispose pas de biométrie, connectez-vous con votre nom d'utilisateur et votre mot de passe
it: il tuo dispositivo non dispone di biometria, accedi con il tuo nome utente e password

# msn_biometry_not_failed_error
source: biometric authentication failed, please log in with your username and password.
es: la autenticación biométrica ha fallado, por favor inicia sesión con tu usuario y contraseña.
fr: l'authentification biométrique a échoué, veuillez vous connecter avec votre nom d'utilisateur et votre mot de passe.
it: l'autenticazione biometrica è fallita, per favore accedi con il tuo nome utente e password

# msn_change_goals_by_coins
source: you can apply %@ to one of the following goals, these
es: puedes aplicar %@ a una de las siguientes metas, estos
fr: tu peux appliquer %@ à l'un des objectifs suivants, ceux-ci
it: puoi applicare %@ a uno dei seguenti obiettivi, questi

# msn_change_goals_by_time
source: You can assign these %@ for one of the following goals
es: Puedes asignar esta(s) %@ a una de las siguientes metas

# msn_change_reward_disabled
source: you don't have enough to redeem this reward
es: no te alcanza para canjear esta recompensa
fr: tu n'as pas assez pour obtenir cette récompense
it: non hai abbastanza per riscattare questo premio

# msn_change_rewards_by_coins
source: you can exchange them for one of the following rewards
es: puedes cambiarlos por una de las siguientes recompensas
fr: vous pouvez les échanger contre l'une des récompenses suivantes
it: puoi scambiarli con uno dei seguenti premi

# msn_change_rewards_by_time
source: you can exchange them for one of the following rewards
es: puedes cambiarlas por una de las siguientes recompensas
fr: vous pouvez les échanger contre l'une des récompenses suivantes
it: puoi scambiarli con uno dei seguenti premi

# msn_check_accept_collect
source: I agree and wish to continue
es: estoy de acuerdo y deseo continuar.
fr: je suis d'accord et je souhaite continuer.
it: sono d'accordo e desidero continuare.

# msn_close_sesion
source: do you really want to log out?
es: ¿realmente quieres cerrar sesión?
fr: voulez-vous vraiment vous déconnecter ?
it: vuoi davvero disconnetterti?

# msn_close_sesion_loading
source: signing out…
es: cerrando sesión…
fr: déconnexion en cours…
it: chiusura sessione in corso

# msn_collect_goal_success
source: your goal has been updated correctly
es: tu meta a sido actualizada correctamente
fr: votre objectif a été mis à jour correctement
it: il tuo obiettivo è stato aggiornato correttamente

# msn_collect_reward_success
source: all set! your reward has been successfully processed. here is your golden ticket, enjoy it!
es: ¡Todo listo! tu recompensa se ha gestionado con éxito. aquí tienes tu golden ticket, ¡disfrútalo!
fr: tout est prêt ! ta récompense a été gérée avec succès. voici ton golden ticket, profites-en !
it: tutto pronto! la tua ricompensa è stata gestita con successo. ecco il tuo golden ticket, divertiti!

# msn_congratulations_reward_golden_ticket
source: congratulations! with this golden ticket you can now claim your reward. your supervisor has also received a copy to stay informed.
es: ¡Felicidades! con este golden ticket ya puedes reclamar tu recompensa. tu responsable también ha recibido una copia para estar al tanto.
fr: félicitations ! avec ce golden ticket, tu peux maintenant réclamer tu récompense. ton responsable a également reçu une copie pour être tenu au courant.
it: congratulazioni! con questo golden ticket ora puoi richiedere il tuo premio. il tuo responsabile ha ricevuto anche una copia per essere informato.

# msn_connection_network_error
source: it looks like you're not connected to the internet, please check your connection and try again
es: parece que no estás conectado a internet, revisa tu conexión e inténtalo de nuevo
fr: il semble que vous ne soyez pas connecté à internet, veuillez vérifier votre connexion et réessayer
it: sembra che tu non sia connesso a internet, controlla la tua connessione e riprova

# msn_create_goal_error
source: your goal could not be created, please try again later
es: tu meta no ha sido posible crearla, por favor inténtalo de nuevo más tarde
fr: votre objectif n'a pas pu être créé, veuillez réessayer plus tard
it: non è stato possibile creare il tuo obiettivo, riprova più tardi

# msn_create_goal_member_data_uncompleted
source: we couldn't get the info to create your goal, please try again later.
es: no pudimos obtener la info para crear tu meta, por favor inténtalo mas tarde.
fr: nous n'avons pas pu obtenir les informations pour créer votre objectif, veuillez réessayer plus tard.
it: non siamo riusciti a ottenere le informazioni per creare il tuo obiettivo, per favore riprova più tardi.

# msn_create_goal_success
source: your goal has been created successfully, you can check it in the goals list
es: tu meta ha sido creada correctamente, puedes consultarla en la lista de metas
fr: votre objectif a été créé avec succès, vous pouvez le consulter en la liste des objectifs
it: il tuo obiettivo è stato creato con successo, puoi consultarlo nell'elenco degli obiettivi

# msn_create_reward_instruction
source: define the name and the amount of time and kindcoins a family member must complete to achieve this goal
es: define el nombre y la cantidad de tiempo y de kindcoins debe realizar algun miembro de la familia para lograr alcanzar esta meta
fr: definissez le nom et la quantite de temps et de kindcoins qu un membre de la famille doit accomplir pour atteindre cet objectif
it: definisci il nome e la quantita di tempo e di kindcoins che un membro della famiglia deve completare per raggiungere questo obiettivo

# msn_create_reward_loading
source: one moment, we are creating the reward
es: un momento, estamos creando la recompensa
fr: un moment, nous creons la recompense
it: un momento, stiamo creando la ricompensa

# msn_create_reward_success
source: the reward has been created successfully
es: la recompensa ha sido creada correctamente
fr: la recompense a ete creee avec succes
it: la ricompensa e stata creata correttamente

# msn_error_cannot_create_reward
source: we could not get the reward information
es: no hemos podido obtener la informacion de la recompensa
fr: nous n avons pas pu obtenir les informations sur la recompense
it: non abbiamo potuto ottenere le informazioni sulla ricompensa

# msn_error_create_goal
source: it wasn't possible to create the goal, please try again later
es: no ha sido posible crear la meta, por favor inténtalo de nuevo más tarde
fr: il n'a pas été possible de créer l'objectif, veuillez réessayer plus tard
it: non è stato possibile creare l'obiettivo, per favore riprova più tardi

# msn_error_create_reward
source: it has not been possible to create the reward, please try again later
es: no ha sido posible crear la recompensa, por favor intentalo mas tarde
fr: il na pas ete possible de creer la recompense, veuillez reessayer plus tard
it: non e stato possibile creare la ricompensa, per favore riprova piu tardi

# msn_error_create_task
source: it wasn't possible to create your task, please try again in a few moments
es: no ha sido posible crear tu tarea, por favor inténtalo de nuevo en unos momentos
fr: il n'a pas été possible de créer votre tâche, veuillez réessayer dans quelques instants
it: non è stato possibile creare il tuo compito, per favore riprova tra qualche istante

# msn_error_duration_type_goal
source: invalid duration type for this goal
es: tipo de duración inválida para esta meta
fr: type de durée invalide pour cet objectif
it: tipo di durata non valido per questo obiettivo

# msn_error_fetch_balance
source: we couldn't retrieve your current balance, please try again later
es: no hemos podido obtener la información de tu saldo actual, inténtalo más tarde
fr: nous n'avons pas pu obtenir votre solde actuel, veuillez réessayer plus tard
it: non siamo riusciti a recuperare il tuo saldo attuale, riprova più tardi

# msn_error_fetch_goal_list
source: error fetching your goals list, please try again later.
es: error obteniendo tu lista de metas, por favor inténtalo más tarde.
fr: erreur lors de la récupération de vos objectifs, veuillez réessayer plus tard.
it: errore durante il recupero del tuo elenco di obiettivi, riprova più tardi.

# msn_error_fetch_task_list
source: error getting your task list, please try again later
es: error obteniendo tu lista de tareas, por favor inténtalo más tarde
fr: erreur lors de la récupération de votre liste de tâches, veuillez réessayer plus tard
it: errore durante il recupero del tuo elenco di attività, per favore riprova più tardi

# msn_error_logout
source: we couldn't sign you out correctly
es: no hemos podido cerrar tu sesión correctamente
fr: nous n'avons pas pu fermer votre session correctement
it: non siamo riusciti a chiudere la sessione correttamente

# msn_error_reward_type_goal
source: the reward type for this goal is invalid
es: el tipo de recompensa para esta meta es inválida
fr: le type de récompense pour cet objectif est invalide
it: il tipo di ricompensa per questo obiettivo non è valido

# msn_error_value_goal
source: the goal fulfillment value is invalid and/or must be greater than zero
es: el valor de cumplimiento de la meta es inválido y/o debe ser mayor a cero
fr: la valeur de réalisation de l'objectif est invalide et/ou doit être supérieure à zéro
it: il valore di raggiungimento dell'obiettivo non è valido e/o deve essere maggiore di zero

# msn_fetch_members_error
source: unable to retrieve your family members, please try again later.
es: no ha sido posible obtener los miembros de su familia, inténtalo más tarde.
fr: impossible d'obtenir les membres de votre famille, réessayez plus tard.
it: non è stato possibile ottenere i membri della tua famiglia, riprova più tardi.

# msn_fetch_rewards_collect_error
source: we couldn't retrieve the collected rewards, please try again later.
es: no hemos podido recuperar las recompensas cobradas, inténtalo más tarde.
fr: nous n'avons pas pu récupérer les récompenses encaissées, réessayez plus tard.
it: non siamo riusciti a recuperare i premi riscossi, riprova più tardi.

# msn_generic_error
source: something went wrong, please try again later.
es: algo salió mal, por favor inténtalo de nuevo más tarde.
fr: un problema est survenu, veuillez réessayer plus tard.
it: qualcosa è andato storto, per favore riprova più tardi.

# msn_goal_reached_success
source: congratulations, you have reached this goal, keep it up!
es: felicidades, has alcanzado esta meta, sigue asi!
fr: félicitations, has atteint cet objectif, continue comme ça!
it: congratulazioni, hai raggiunto questo obiettivo, continua così!

# msn_goals_in_curse
source: goals currently in progress
es: metas actualmente en curso
fr: objectifs actuellement en cours
it: obiettivi attualmente in corso

# msn_members_added_success
source: new member(s) successfully added, you can now manage goals, rewards, and view progress from your home.
es: nuevo(s) miembro(s) añadidos correctamente, ahora puedes gestionar metas, recompensas y ver progresos desde tu home.
fr: nouveau(x) membre(s) ajouté(s) avec succès, vous pouvez maintenant gérer les objectifs, les récompenses et voir les progrès depuis votre accueil.
it: nuovo(i) membro(i) aggiunto(i) correttamente, ora puoi gestire obiettivi, premi e vedere i progressi dalla tua home.

# msn_of_your
source: of your
es: de tus
fr: de vos
it: dei tuoi

# msn_operation_error
source: it was not possible to perform the operation, please try again later
es: no ha sido posible realizar la operación, por favor inténtalo más tarde
fr: il n'a pas été possible d'effectuer l'opération, veuillez réessayer plus tard
it: non è stato possibile eseguire l'operazione, riprova più tardi

# msn_pin_approve_wrong
source: the pin entered to approve tasks is not valid
es: el pin ingresado para aprobar tareas no es válido
fr: le code pin saisi pour approuver les tâches n'est pas valide
it: il pin inserito per approvare i compiti non è valido

# msn_proccessing_information_secure
source: it was not possible to manage the information securely, please close the app and try again
es: no ha sido posible gestionar la información de forma segura, cierre la app y vuelva a intentarlo
fr: il n'a pas été possible de gérer les informations en toute sécurité, veuillez fermer l'application et réessayer
it: non è stato possibile gestire le informazioni in modo sicuro, chiudi l'app e riprova

# msn_recovery_info_user_error
source: we couldn't retrieve your information from your device.
es: no hemos podido recuperar tu información desde tu dispositivo.
fr: nous n'avons pas pu récupérer vos informations depuis votre appareil.
it: non siamo riusciti a recuperare le tue informazioni dal tuo dispositivo.

# msn_register_user_error
source: the registration data is invalid, please check it.
es: los datos de registro no son válidos, por favor revísalos.
fr: les données d'inscription ne sont pas valides, veuillez les vérifier.
it: i dati di registrazione non sono validi, si prega di verificarli.

# msn_register_user_success
source: user registered successfully, you must confirm the email we have sent to the address you just registered. please also check your spam folder
es: usuario registrado correctamente, debes confirmar el correo que hemos enviado al correo que acabas de registrar. revisa también tu bandeja de spam
fr: utilisateur enregistré avec succès, vous devez confirmer l'e-mail que nous avons envoyé à l'adresse que vous venez d'enregistrer. vérifiez également votre dossier spam
it: utente registrato correttamente, devi confermare l'e-mail che abbiamo inviato all'indirizzo che hai appena registrato. controlla anche la tua cartella spam

# msn_remaining_time
source: your %@ leftovers will be deposited to your balance
es: tus %@ sobrantes seran depositados a tu saldo
fr: tes %@ restes seront déposés sur ton solde
it: i tuoi %@ avanzi saranno depositati sul tuo saldo

# msn_rewards_loading
source: getting the rewards list
es: obteniendo el listado de recompensas
fr: obtention de la liste des recompenses
it: ottenendo la lista delle ricompense

# msn_screen_security
source: for security reasons, this application cannot run on jailbroken devices.
es: por razones de seguridad, esta aplicación no puede ejecutarse en dispositivos con modificaciones de sistema (Jailbreak).
fr: pour des raisons de sécurité, cette application ne peut pas fonctionner sur les appareils jailbreakés.
it: per motivi di sicurezza, questa applicazione non può essere eseguita su dispositivi jailbroken.

# msn_success_create_task
source: your task has been created successfully, from now on it will be available in your task list
es: tu tarea ha sido creada correctamente, a partir de ahora estará disponible en tu lista de tareas
fr: votre tâche a été créée avec succès, elle sera désormais disponible dans votre liste de tâches
it: il tuo compito è stato creato correttamente, d'ora in poi sarà disponibile nella tua lista dei compiti

# msn_too_many_requests_error
source: too many attempts, please wait a moment.
es: demasiados intentos, espera un momento.
fr: trop de tentatives, veuillez patienter un instant.
it: troppi tentativi, attendi un momento.

# msn_type_data_invalid_error
source: the data format is incorrect.
es: el formato de los datos es incorrecto.
fr: le format des données est incorrect.
it: il formato dei dati è errato.

# msn_unexpected_error
source: the operation could not be completed, please try again, if the problem persists contact our support team
es: la operación no se ha podido completar, intentalo de nuevo, si el problema persiste contacta con nuestro equipo de soporte
fr: l'opération n'a pas pu être terminée, veuillez réessayer, si le problème persiste contactez notre équipe d'assistance
it: l’operazione non è stata completata, riprova, se il problema persiste contatta il nostro team de supporto

# msn_update_balance_success
source: the balance has been updated successfully.
es: el saldo ha sido actualizado correctamente.
fr: le solde a été mis à jour avec succès.
it: il saldo è stato aggiornato correttamente.

# msn_value_real_goal
source: value in euros: %@€
es: valor en euros: %@€
fr: valeur en euros: %@€
it: valore in euro: %@€

# msn_want_remove_member
source: do you want to remove member (%@)?
es: ¿deseas eliminar al miembro (%@)?
fr: voulez-vous supprimer le membre (%@) ?
it: vuoi eliminare il membro (%@)?

# name_create_reward_placeholder
source: reward name
es: nombre de la recompensa
fr: nom de la recompense
it: nome della ricompensa

# otp_expired_error
source: opt expired.
es: otp expirada
fr: opt expiré.
it: opt scaduto.

source: password
es: contraseña
fr: mot de passe

# profile
source: my profile
es: mi perfil
fr: mon profil
it: il mio profilo

# prompt_face_id
source: use face ID to log in
es: usa face ID para entrar
fr: utilisez face ID pour entrer
it: usa il face ID per accedere

# prompt_generic_id
source: authenticate to log in
es: identifícate para entrar
fr: identifiez-vous pour entrer
it: identificati per accedere

# prompt_touch_id
source: use touch ID to log in
es: usa touch ID para entrar
fr: utilisez touch ID pour entrer
it: usa il touch ID per accedere

# refresh_session_error
source: refresh session. try again.
es: actualizar sesión. Inténtalo de nuevo.
fr: Actualiser la session. Veuillez réessayer.
it: Aggiorna la sessione. Riprova.

# register
source: register me
es: registrarme
fr: registre
it: registro
